{
  "project": "grove",
  "branchName": "ralph/ux-redesign-v2",
  "description": "Major UX redesign: center the app around Dialectics as the home screen, add proactive conversation starters (prompt bubbles), auto-board creation, redesign Synthesis as a reusable tool, add full-text search, add actionable outputs in Dialectics, and simplify the nudge/service architecture by cutting or folding redundant features.",
  "userStories": [
    {
      "id": "US-001",
      "title": "Home screen is the Dialectics landing state with prompt bubbles",
      "description": "As a user, I want the app's home screen to show 2-3 contextual conversation starters as tappable prompt bubbles so that I always have something to engage with when I open Grove, solving the blank-canvas problem.",
      "acceptanceCriteria": [
        "App launches to a new HomeView (not the previous Library or sidebar-first layout)",
        "HomeView shows 2-3 prompt bubbles in a visually distinct style (not nudge banners)",
        "Below the prompt bubbles, show a compressed recent-items list and a capture button",
        "Tapping a prompt bubble navigates into DialecticsView with that prompt pre-filled as the first user message",
        "If no prompts are available (LLM offline, empty knowledge base), show a single fallback: 'Start a conversation' that opens an empty Dialectics session",
        "Typecheck passes"
      ],
      "priority": 1,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-002",
      "title": "Conversation starter generation service",
      "description": "As a user, I want the prompt bubbles on the home screen to be contextually relevant to my recent activity, stale items, and contradictions, so the app feels like a thinking partner that noticed something interesting.",
      "acceptanceCriteria": [
        "Create ConversationStarterService (or a method on DialecticsService) that generates 2-3 starters",
        "Service takes recent items (last 7 days), stale high-value items (untouched 30+ days), and items with .contradicts connections as input context",
        "Single LLM call with a system prompt that returns JSON array of {prompt: String, itemIDs: [String]} objects",
        "Heuristic fallback when LLM is unavailable: surface 2 starters based on staleness ('You haven't revisited X in N weeks') and recency ('You saved 3 things about Y recently')",
        "Results are cached in memory per app launch — do not re-call LLM on every HomeView appearance",
        "Typecheck passes"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-003",
      "title": "Auto-board suggestion on capture",
      "description": "As a user, I want Grove to suggest creating a new board when I save an item that doesn't fit any existing board, so my knowledge base organizes itself without me managing boards manually.",
      "acceptanceCriteria": [
        "After AutoTagService runs on capture, evaluate the board assignment confidence score",
        "If best board match confidence is below threshold (e.g. < 0.4) AND no board was manually selected, show an inline suggestion below the capture field: 'This doesn't fit your existing boards. Create [suggested name]?'",
        "Suggested board name comes from AutoTagService response (add a suggestedBoardName field to AutoTagResponse if not present)",
        "User can tap 'Create' (creates board + assigns item), 'Dismiss' (item saved with no board), or just ignore (suggestion auto-dismisses after 5 seconds)",
        "The suggestion is non-blocking — the item is already saved, this is a post-save prompt",
        "If the user has zero boards (cold start), always suggest a board name on the first 3 captures",
        "Typecheck passes"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-004",
      "title": "Unboarded items surfaced as conversation starter",
      "description": "As a user, I want Grove to notice when I have a cluster of unboarded items sharing tags and suggest grouping them, surfaced as a prompt bubble on the home screen rather than an automatic action.",
      "acceptanceCriteria": [
        "ConversationStarterService (from US-002) includes an additional heuristic check: find unboarded items that share 2+ tags with at least 4 other unboarded items",
        "If a cluster is found, one of the 2-3 prompt bubbles can be a board-suggestion starter, e.g. 'You have 6 items about continental philosophy floating around. Want to organize them?'",
        "Tapping this starter opens a Dialectics conversation where the agent can list the items, suggest a board name, and the user can confirm",
        "Add a create_board tool to KnowledgeBaseTools that creates a Board and assigns specified items to it",
        "The create_board tool is a write tool — creates Board entity and updates Item.board relationships",
        "This prompt bubble type should appear at most once per app launch to avoid nagging",
        "Typecheck passes"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-005",
      "title": "Full-text search bar in Library view",
      "description": "As a user, I want a prominent search bar in the Library that queries across item titles, content, tags, and reflections so I can quickly find anything in my knowledge base.",
      "acceptanceCriteria": [
        "Library view has a persistent search bar at the top (always visible, not hidden behind a button)",
        "Search queries SwiftData across Item title, content, Tag names, and ReflectionBlock content",
        "Results update as the user types (debounced, ~300ms delay)",
        "Results show item cards with the matching text highlighted or indicated",
        "Empty search state shows the default library view (reverse-chronological all items)",
        "Boards act as filters alongside search — selecting a board narrows search scope to that board",
        "Typecheck passes"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-006",
      "title": "Discuss this: item-anchored Dialectics conversations",
      "description": "As a user, I want to tap a 'Discuss' button on any item in the Library or Inspector and land in a Dialectics conversation with that item pre-loaded as context, so I can think deeply about specific items.",
      "acceptanceCriteria": [
        "Item cards in Library and the InspectorView both show a 'Discuss' action (button or context menu)",
        "Tapping 'Discuss' creates a new Conversation entity with the item's title and content included in the initial system context",
        "DialecticsView opens with a pre-generated opening message from the assistant that references the item (e.g., 'Let's explore your note on X. What aspect interests you?')",
        "The item's ID is stored in the Conversation metadata so the conversation is linked to that item",
        "Typecheck passes"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-007",
      "title": "Actionable outputs in Dialectics — save as note",
      "description": "As a user, I want to save a Dialectics response as a new Item in my knowledge base with one tap, so that insights from conversations become persistent, searchable knowledge artifacts.",
      "acceptanceCriteria": [
        "Each assistant message in DialecticsView shows a subtle 'Save as note' action button",
        "Tapping 'Save as note' creates a new Item(.note) with the message content as the body",
        "The new item's title is auto-generated from the first sentence or a summary",
        "Tags are generated via AutoTagService on the new item",
        "A Connection entity is created linking the new item to the conversation's source item (if the conversation was item-anchored via US-006)",
        "A brief toast/confirmation is shown after saving",
        "Typecheck passes"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-008",
      "title": "Actionable outputs in Dialectics — add reflection to item",
      "description": "As a user, when Dialectics references one of my items with a [[wiki-link]], I want to be able to add the insight as a ReflectionBlock on that item with one tap.",
      "acceptanceCriteria": [
        "When a Dialectics response contains [[wiki-links]], those links are rendered as tappable inline elements",
        "Tapping a wiki-link shows a popover with two options: 'View item' and 'Add reflection'",
        "Choosing 'Add reflection' creates a ReflectionBlock on the referenced item with the surrounding paragraph as content",
        "The reflection block type defaults to .keyInsight but can be changed by the user",
        "Typecheck passes"
      ],
      "priority": 8,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-009",
      "title": "Actionable outputs in Dialectics — create connection between items",
      "description": "As a user, when Dialectics identifies a relationship between two of my items, I want to create a typed Connection between them with one tap.",
      "acceptanceCriteria": [
        "When a Dialectics response contains two or more [[wiki-links]], show a 'Create connection' action",
        "Tapping 'Create connection' shows a sheet with the two items and a picker for connection type (contradicts, buildsOn, inspiredBy, relatedTo)",
        "The connection type is pre-selected based on the LLM's language in the response if detectable (e.g., 'contradicts' if the response says 'this contradicts')",
        "Saving creates a Connection entity between the two items",
        "Typecheck passes"
      ],
      "priority": 9,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-010",
      "title": "Conversation history: browsable and searchable past Dialectics sessions",
      "description": "As a user, I want to browse and search my past Dialectics conversations so I can revisit previous thinking and find conclusions I reached earlier.",
      "acceptanceCriteria": [
        "A 'History' section or tab is accessible from the Dialectics view",
        "Shows a reverse-chronological list of past Conversations with title, date, and item count",
        "Search bar filters conversations by title and message content",
        "Tapping a conversation opens it in read-only mode with the full message history",
        "User can continue a past conversation (creates new messages appended to the existing Conversation entity)",
        "Typecheck passes"
      ],
      "priority": 10,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-011",
      "title": "Redesign SynthesisService: add create_synthesis as a Dialectics write tool",
      "description": "As a user, I want to trigger synthesis both from the Library (select items → synthesize) and from Dialectics ('synthesize my notes on X'), with both paths producing a persistent Item(.note) with connections to source items.",
      "acceptanceCriteria": [
        "SynthesisService is kept and works as before when invoked directly from Library (multi-select items → 'Synthesize' button)",
        "A new KnowledgeBaseTools tool called 'create_synthesis' is added that accepts a list of item titles/IDs and a focus prompt",
        "The create_synthesis tool calls SynthesisService internally and returns the created item's title and ID",
        "DialecticsService system prompt is updated to include create_synthesis in its available tools",
        "The agentic loop handles create_synthesis as a write tool (creates Item and Connection entities)",
        "In Dialectics, after synthesis is created, the assistant message includes a link to the new synthesis item",
        "Typecheck passes"
      ],
      "priority": 11,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-012",
      "title": "Update Dialectics system prompt for multi-mode dialectical approach",
      "description": "As a user, I want Dialectics conversations to adapt their philosophical approach — Socratic questioning, Hegelian thesis-antithesis-synthesis, Nietzschean perspectivism — based on the shape of my knowledge, rather than always defaulting to Socratic elenchus.",
      "acceptanceCriteria": [
        "DialecticsService system prompt is rewritten to describe three dialectical modes without naming a default",
        "System prompt instructs the LLM to choose mode based on context: Socratic when probing assumptions, Hegelian when contradictions exist between items, Nietzschean when the user has collected multiple perspectives without committing",
        "UI labels and strings throughout the app say 'Dialectics' not 'Socratic Dialectics' or 'Socratic conversation'",
        "No user-facing UI changes needed beyond string updates — the mode selection is in the system prompt",
        "Typecheck passes"
      ],
      "priority": 12,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-013",
      "title": "Simplify NudgeEngine: remove streak, continue-course, and connection-prompt nudges",
      "description": "As a developer, I want to remove the streak nudge, continue-course nudge, and connection-prompt heuristic nudge types from NudgeEngine, keeping only spaced-resurfacing and stale-inbox, so the app's proactive surface is the home screen prompt bubbles rather than a multi-strategy nudge pipeline.",
      "acceptanceCriteria": [
        "NudgeEngine no longer evaluates streak, continue-course, or connection-prompt strategies",
        "ResurfacingService (spaced resurfacing) is kept and runs on its existing timer",
        "Stale-inbox heuristic is kept",
        "NudgeBanner UI is removed from Library/HomeView — resurfacing results are exposed as a count indicator in the Library (e.g., '3 items to revisit') that the user can tap to see the list",
        "SmartNudgeService is removed (its role is replaced by ConversationStarterService from US-002)",
        "CheckInTriggerService is removed (its role is replaced by ConversationStarterService from US-002)",
        "Typecheck passes"
      ],
      "priority": 13,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-014",
      "title": "Remove LearningPathView and LearningPathService",
      "description": "As a developer, I want to remove LearningPathService, LearningPathView, and the LearningPath data model so the codebase is simpler. Users can ask Dialectics to suggest a learning sequence if they want one.",
      "acceptanceCriteria": [
        "LearningPathService is deleted",
        "LearningPathView is deleted",
        "LearningPath and LearningPathStep SwiftData models are removed (or marked deprecated with a migration that removes existing data)",
        "All references to learning paths in navigation, sidebar, or menus are removed",
        "Typecheck passes"
      ],
      "priority": 14,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-015",
      "title": "Remove automatic WeeklyDigest generation",
      "description": "As a developer, I want to remove the automatic weekly digest item creation from NudgeEngine so the knowledge base isn't polluted with meta-content. Users can ask Dialectics 'summarize my week' to get the same output on demand.",
      "acceptanceCriteria": [
        "WeeklyDigestService is no longer triggered automatically by NudgeEngine on app launch",
        "WeeklyDigestService itself is kept in the codebase but not auto-invoked (it can be called manually or via Dialectics in a future story)",
        "No digest Items are auto-created on the weekly schedule",
        "Typecheck passes"
      ],
      "priority": 15,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-016",
      "title": "Remove standalone ReflectionPromptService UI from InspectorView",
      "description": "As a developer, I want to remove the auto-generated reflection prompts from InspectorView so the inspector becomes a clean read/edit view. Reflection prompting is now handled by Dialectics conversations (via US-006 'Discuss this').",
      "acceptanceCriteria": [
        "InspectorView no longer calls ReflectionPromptService on appearance",
        "The 'suggested reflections' or 'reflection prompts' section is removed from InspectorView",
        "InspectorView still displays existing ReflectionBlock entities (user's past reflections remain visible)",
        "ReflectionPromptService is kept in the codebase but not auto-invoked from InspectorView",
        "Typecheck passes"
      ],
      "priority": 16,
      "passes": false,
      "notes": ""
    },
    {
      "id": "US-017",
      "title": "Remove standalone ConnectionSuggestionService UI from InspectorView",
      "description": "As a developer, I want to remove the auto-generated connection suggestions from InspectorView. Connection discovery is now handled by Dialectics conversations. The inspector keeps manual connection management.",
      "acceptanceCriteria": [
        "InspectorView no longer calls ConnectionSuggestionService on appearance",
        "The 'suggested connections' section is removed from InspectorView",
        "InspectorView still displays existing Connection entities and allows manual connection creation (search-to-link)",
        "ConnectionSuggestionService is kept in the codebase but not auto-invoked from InspectorView",
        "Typecheck passes"
      ],
      "priority": 17,
      "passes": false,
      "notes": ""
    }
  ]
}
