{
  "projectName": "Grove",
  "branchName": "feature/grove-v1",
  "description": "A Mac-native knowledge companion that captures articles, videos, and ideas into boards with auto-tagging, then nudges users to engage with their saved knowledge.",
  "userStories": [
    {
      "id": "S1",
      "title": "SwiftData Models",
      "priority": 1,
      "passes": true,
      "description": "Define all SwiftData models with relationships and enums.",
      "acceptanceCriteria": [
        "Item model with id, title, type (article/video/note/courseLecture), status (inbox/active/archived/dismissed), sourceURL, content, thumbnail, engagementScore, metadata, createdAt, updatedAt",
        "Board model with id, title, description, icon (SF Symbol name), color (hex string), sortOrder, isSmart bool",
        "Tag model with id, name, isAutoGenerated, confidence (Float?), category (topic/concept/technology/person/custom)",
        "Connection model with id, sourceItem, targetItem, type (related/contradicts/buildsOn/inspiredBy/sameTopic), note, isAutoGenerated, createdAt",
        "Annotation model with id, item, content (markdown String), highlight, position (Int?), createdAt",
        "Nudge model with id, type (resurface/connectionPrompt/staleInbox/streak), targetItem, message, status (pending/shown/actedOn/dismissed), scheduledFor, createdAt",
        "All enums conform to String, Codable",
        "All @Relationship annotations have explicit inverse and deleteRule",
        "Item has many-to-many with Board and Tag, one-to-many with Annotation, and relationships to Connection (outgoing and incoming)",
        "Project builds and all models compile without errors",
        "Reference spec.md and CLAUDE.md for full model definitions"
      ]
    },
    {
      "id": "S2",
      "title": "App Shell with NavigationSplitView",
      "priority": 2,
      "passes": true,
      "description": "Create the three-column layout shell with sidebar, content area, and collapsible inspector.",
      "acceptanceCriteria": [
        "GroveApp.swift uses WindowGroup with modelContainer for all 6 model types",
        "ContentView uses NavigationSplitView with three columns",
        "Sidebar shows: Inbox row with badge count, Boards section with list of boards, Tags browser row",
        "Sidebar uses .sidebar listStyle and native macOS styling",
        "Content area shows placeholder text based on sidebar selection",
        "Inspector panel is collapsible via toolbar button",
        "App launches and displays the three-column layout correctly",
        "Dark mode looks correct — this is the primary design target",
        "Window has a reasonable default size (1200x800 minimum)"
      ]
    },
    {
      "id": "S3",
      "title": "Board CRUD",
      "priority": 3,
      "passes": true,
      "description": "Create, read, update, and delete boards from the sidebar.",
      "acceptanceCriteria": [
        "Add Board button in sidebar creates a new board with a sheet/popover for title, SF Symbol icon picker, and color picker",
        "Boards appear in sidebar with their icon and color dot",
        "Boards are ordered by sortOrder and can be reordered via drag-and-drop",
        "Right-click context menu on a board offers Edit and Delete",
        "Edit opens the same sheet/popover to modify title, icon, color",
        "Delete removes the board (with confirmation) but does not delete the items in it",
        "Selecting a board in sidebar shows BoardDetailView in the content area",
        "BoardViewModel handles all CRUD operations through ModelContext"
      ]
    },
    {
      "id": "S4",
      "title": "Item Creation and Board Detail View",
      "priority": 4,
      "passes": true,
      "description": "Create note items manually and display items in a board grid/list view.",
      "acceptanceCriteria": [
        "New Note button (⌘+N) creates a note Item and opens it for editing",
        "Notes have a title field and a markdown content area",
        "Items can be assigned to one or more boards",
        "BoardDetailView shows items as cards in a grid layout (default)",
        "Each card shows: type icon (SF Symbol), title, connection count badge, annotation count badge",
        "Toggle between grid and list view via toolbar segmented control",
        "Sort options in toolbar: date added, title, engagement score",
        "Empty state when board has no items with helpful message"
      ]
    },
    {
      "id": "S5",
      "title": "Inspector Panel",
      "priority": 5,
      "passes": true,
      "description": "Show and edit item details in the right inspector panel.",
      "acceptanceCriteria": [
        "Selecting an item in the board view populates the inspector",
        "Inspector shows: title (editable), source URL, item type, created/updated dates",
        "Tag section shows current tags with ability to add/remove",
        "Adding a tag uses a text field with fuzzy-search autocomplete of existing tags",
        "Board membership section shows which boards the item belongs to",
        "Connections section shows linked items with their connection type label",
        "Inspector is collapsible via ⌘+] keyboard shortcut",
        "All edits save immediately through SwiftData (no save button needed)"
      ]
    },
    {
      "id": "S6",
      "title": "Quick Capture — Menu Bar",
      "priority": 6,
      "passes": true,
      "description": "Global quick capture via menu bar extra and keyboard shortcut.",
      "acceptanceCriteria": [
        "MenuBarExtra icon appears in the macOS menu bar",
        "⌘+Shift+K opens a floating capture panel from anywhere",
        "Panel has a single text field — paste a URL or type text",
        "If input is a URL: auto-detect and set item type to .article or .video",
        "If input is plain text: create a .note item with the text as content",
        "Captured items get status .inbox automatically",
        "Panel dismisses on submit (Enter key)",
        "Entire interaction takes under 3 seconds"
      ]
    },
    {
      "id": "S7",
      "title": "URL Metadata Fetching",
      "priority": 7,
      "passes": true,
      "description": "When a URL is captured, fetch its title, description, and thumbnail via OpenGraph/meta tags.",
      "acceptanceCriteria": [
        "URLMetadataFetcher service fetches the HTML of a given URL",
        "Extracts og:title, og:description, og:image from meta tags",
        "Falls back to <title> tag and meta description if OpenGraph tags missing",
        "Populates Item title, content (description), and thumbnail from fetched metadata",
        "Handles errors gracefully — if fetch fails, item still saves with the raw URL as title",
        "Fetching is async and does not block the capture panel",
        "Works for common sites: YouTube, Medium, GitHub, blog posts"
      ]
    },
    {
      "id": "S8",
      "title": "Inbox View and Triage Flow",
      "priority": 8,
      "passes": true,
      "description": "Dedicated inbox view with card-based triage for captured items.",
      "acceptanceCriteria": [
        "Selecting Inbox in sidebar shows InboxTriageView",
        "Shows all items with status .inbox, newest first",
        "Each inbox card shows: title, source domain, capture date, auto-tags (if any), suggested board (if any)",
        "Three action buttons per card: Keep, Later, Drop",
        "Keep: sets status to .active, prompts to assign to a board",
        "Later: keeps in inbox, item stays visible",
        "Drop: sets status to .dismissed, card animates away",
        "Keyboard shortcuts: J/K to navigate between cards, 1/2/3 for Keep/Later/Drop",
        "Badge count in sidebar Inbox row updates in real-time",
        "Empty state when inbox is clear with encouraging message"
      ]
    },
    {
      "id": "S9",
      "title": "Tag System and Manual Tagging",
      "priority": 9,
      "passes": true,
      "description": "Full tag management — create, assign, remove, browse tags.",
      "acceptanceCriteria": [
        "Tags can be created inline when tagging an item (type a new name, press Enter)",
        "Tags have categories: topic, concept, technology, person, custom",
        "Tag browser view (accessible from sidebar) shows all tags grouped by category",
        "Clicking a tag in the browser shows all items with that tag",
        "Tags can be removed from items via the inspector",
        "Duplicate tag names are prevented (case-insensitive)",
        "Tags appear as colored pills/chips in the UI"
      ]
    },
    {
      "id": "S10",
      "title": "Tag Clustering in Board View",
      "priority": 10,
      "passes": true,
      "description": "Auto-group items within a board by shared tag overlap.",
      "acceptanceCriteria": [
        "Items in a board are grouped into sections based on shared tags",
        "Each section has an auto-generated label derived from the common tags (e.g., 'concurrency & async/await')",
        "Items with no tag overlap appear in an 'Uncategorized' section",
        "Sections are collapsible",
        "Filter bar at top of board allows filtering by tag — clicking a tag shows only items with that tag",
        "Clustering updates dynamically as items and tags change"
      ]
    },
    {
      "id": "S11",
      "title": "Annotations and Markdown Notes",
      "priority": 11,
      "passes": true,
      "description": "Inline annotations on items with markdown support.",
      "acceptanceCriteria": [
        "Item reader view shows article content or note content",
        "Add Annotation button opens a markdown text field below the content",
        "Annotations support basic markdown: headings, bold/italic, code blocks, links",
        "Annotations are listed chronologically below the item content",
        "Each annotation shows its created date and content",
        "Annotations can be edited and deleted",
        "Markdown is rendered using swift-markdown parser",
        "Annotation count badge on item cards updates correctly"
      ]
    },
    {
      "id": "S12",
      "title": "Connections and Wiki-Links",
      "priority": 12,
      "passes": true,
      "description": "Create item-to-item connections manually and via [[ ]] wiki-link syntax.",
      "acceptanceCriteria": [
        "Add Connection button in inspector opens a fuzzy-search popover of all items",
        "Selecting an item creates a Connection with a choosable type (related, buildsOn, contradicts, inspiredBy, sameTopic)",
        "Connections appear in inspector for both source and target items",
        "In any markdown text field (annotations, notes), typing [[ opens a fuzzy-search dropdown",
        "Selecting an item from the dropdown inserts a wiki-link and auto-creates a Connection of type .related",
        "Wiki-links render as tappable links that navigate to the linked item",
        "Connections can be deleted from the inspector"
      ]
    },
    {
      "id": "S13",
      "title": "Global Search",
      "priority": 13,
      "passes": true,
      "description": "Search across all items, annotations, tags, and boards.",
      "acceptanceCriteria": [
        "⌘+F opens a search bar overlay (similar to Spotlight)",
        "Fuzzy matches on: item titles, item content, annotation content, tag names, board titles",
        "Results are grouped by type with section headers",
        "Selecting a result navigates to that item/board",
        "Search is fast — results appear as you type with no perceptible delay",
        "Search within a board context scopes results to that board",
        "Empty state for no results"
      ]
    },
    {
      "id": "S14",
      "title": "Basic Nudge System",
      "priority": 14,
      "passes": true,
      "description": "Resurface and stale inbox nudges displayed in a non-blocking bar.",
      "acceptanceCriteria": [
        "NudgeEngine generates nudges on app launch",
        "Resurface nudge: picks a random .active item not opened in 14+ days, creates nudge with message like 'You saved [title] X days ago. Still relevant?'",
        "Stale inbox nudge: if inbox has 5+ items older than 14 days, creates nudge 'You have X items waiting in your inbox'",
        "NudgeBarView appears at top of content area, shows one nudge at a time",
        "Nudge has an action button (e.g., 'Open' or 'Triage') and a Dismiss button",
        "Acting on a nudge sets its status to .actedOn, dismissing sets .dismissed",
        "Dismissed nudges don't recur for the same item for 30 days",
        "Nudge bar is visually subtle — not a modal, not blocking content"
      ]
    },
    {
      "id": "S15",
      "title": "Keyboard Shortcuts and Polish",
      "priority": 15,
      "passes": true,
      "description": "Full keyboard navigation, consistent styling, and final polish pass.",
      "acceptanceCriteria": [
        "⌘+Shift+K: Quick capture",
        "⌘+N: New note",
        "⌘+F: Global search",
        "⌘+1/2/3...: Switch between boards by position",
        "J/K: Navigate items in board view and inbox",
        "Enter: Open selected item",
        "⌘+]: Toggle inspector",
        "All keyboard shortcuts are discoverable in the menu bar menus",
        "Consistent use of SF Symbols throughout",
        "Sidebar uses .sidebar material styling",
        "Dark mode is polished — no contrast issues, proper use of system colors",
        "Animations on card transitions (inbox triage, adding/removing items)",
        "App feels responsive — no janky scrolling, no layout jumps"
      ]
    },


    {
      "id": "S16",
      "title": "[v1.5] Connection Suggestions",
      "priority": 16,
      "passes": true,
      "description": "AI-powered suggestions for connections between items after capture or annotation.",
      "acceptanceCriteria": [
        "After saving a new item or annotation, a ConnectionSuggestionService analyzes it against existing items",
        "Service uses text similarity (title + content + tags) to find candidate connections",
        "Top 3 suggestions shown in a non-blocking popover: 'This might relate to [item]. Connect?'",
        "Each suggestion includes a recommended connection type (buildsOn, related, etc.)",
        "User can accept (creates Connection), dismiss, or ignore",
        "Dismissed suggestions don't recur for that item pair",
        "Suggestion quality improves over time — items the user frequently connects inform future suggestions",
        "Start with keyword/tag overlap heuristics, upgrade to LLM-based later"
      ]
    },
    {
      "id": "S17",
      "title": "[v1.5] Smart Boards",
      "priority": 17,
      "passes": true,
      "description": "Boards that auto-populate based on tag rules.",
      "acceptanceCriteria": [
        "Board model has isSmart flag and smartRuleTags relationship",
        "When creating a board, user can toggle 'Smart Board' and select tags as rules",
        "Smart board query builder: select tags with AND/OR logic (e.g., items tagged #concurrency AND #swift)",
        "Smart boards auto-populate — items matching the tag rules appear without manual assignment",
        "Items appear/disappear from smart boards as tags are added or removed",
        "Smart boards are visually distinct in sidebar (different icon or indicator)",
        "Smart board rules are editable after creation",
        "Regular boards still work as before — smart boards are additive"
      ]
    },
    {
      "id": "S18",
      "title": "[v1.5] Graph Visualization",
      "priority": 18,
      "passes": true,
      "description": "Interactive knowledge graph showing items as nodes and connections as edges.",
      "acceptanceCriteria": [
        "Graph View entry point in sidebar opens a full-width visualization",
        "Items rendered as nodes — sized by engagement score, colored by board membership",
        "Connections rendered as edges — styled by type (solid for buildsOn, dashed for related, red for contradicts)",
        "Force-directed layout using SpriteKit or Core Animation",
        "Smooth pan, zoom, and drag interactions",
        "Click a node to select it — inspector shows that item's detail",
        "Filter dropdown to scope graph to a specific board or tag",
        "Nodes cluster naturally by connection density",
        "Performance stays smooth up to 500 nodes"
      ]
    },
    {
      "id": "S19",
      "title": "[v1.5] Advanced Nudges",
      "priority": 19,
      "passes": true,
      "description": "Connection prompts and streak nudges beyond basic resurfacing.",
      "acceptanceCriteria": [
        "Connection prompt nudge: 'You added 3 articles on [topic] this week. Want to write a synthesis note?' — triggered when 3+ items share a tag within 7 days",
        "Streak nudge: 'You've engaged with [board] 5 days in a row' — triggered by consecutive days with opens/annotations in a board",
        "Nudge frequency configurable per-board in board settings",
        "Nudge type toggles in Settings — user can disable specific nudge categories",
        "Nudge analytics tracked: which nudge types get acted on vs dismissed",
        "NudgeEngine runs on a schedule (configurable, default every 4 hours)",
        "Never show more than 2 nudges per day unless user has high engagement"
      ]
    },
    {
      "id": "S20",
      "title": "[v1.5] Tag Clustering Improvements",
      "priority": 20,
      "passes": true,
      "description": "Smarter tag management with merge suggestions and hierarchy detection.",
      "acceptanceCriteria": [
        "Detect near-duplicate tags and suggest merges (e.g., 'async-await' and 'async/await')",
        "Merge action: combines two tags into one, updates all item associations",
        "Tag hierarchy suggestions: detect parent-child relationships (e.g., 'Swift' parent of 'SwiftUI')",
        "Hierarchy is informational — shown in tag browser as indented children, not enforced as a constraint",
        "Semantic similarity for clustering uses tag names and co-occurrence frequency, not just exact match",
        "Board view tag clusters use improved algorithm for more meaningful groupings",
        "Tag browser shows tag usage count and trend (increasing/stable/decreasing)"
      ]
    },


    {
      "id": "S21",
      "title": "[v2] Course Tracking",
      "priority": 21,
      "passes": false,
      "description": "First-class support for lecture series and courses with progress tracking.",
      "acceptanceCriteria": [
        "New content type: Course — a container for ordered courseLecture items",
        "Create Course flow: title, source URL, add lectures in order (URL + title per lecture)",
        "Course detail view shows lectures as an ordered list with completion checkboxes",
        "Progress bar shows percentage of lectures completed",
        "Lectures are Item objects with type .courseLecture and a sequence/order metadata field",
        "'Continue course' action in nudge: 'Lecture 5 of MIT 6.824 is next. It covers fault tolerance — you have 2 saved articles on that topic.'",
        "Supplementary materials: link articles/notes to specific lectures",
        "Course view shows linked supplementary items alongside each lecture",
        "Support for common course sources: YouTube playlists, MIT OCW, Stanford Online"
      ]
    },
    {
      "id": "S22",
      "title": "[v2] AI Synthesis Notes",
      "priority": 22,
      "passes": false,
      "description": "AI-generated summary notes that synthesize knowledge across items in a board or tag cluster.",
      "acceptanceCriteria": [
        "'Generate Synthesis' action available on boards and tag clusters",
        "AI reads all items + annotations in scope and generates a draft markdown note",
        "Draft highlights: key themes across sources, contradictions between sources, open questions",
        "Draft appears as a new Item of type .note, linked via Connections to all source items",
        "Explicitly marked as AI-generated (metadata flag + visual indicator)",
        "User can edit the draft freely — edit history preserved",
        "Works with local LLM (Core ML) or API call (configurable in settings)",
        "Synthesis respects item count limits — works best with 3-15 items, warns if scope is too large"
      ]
    },
    {
      "id": "S23",
      "title": "[v2] Spaced Resurfacing",
      "priority": 23,
      "passes": false,
      "description": "Intelligent resurfacing of items based on engagement patterns, not just time.",
      "acceptanceCriteria": [
        "Items with annotations or connections enter a resurfacing queue",
        "Resurfacing interval adapts: items you keep engaging with resurface less often (you already know them), items you engaged with once resurface more",
        "Interval algorithm: base 7 days, doubles after each engagement, resets to 7 after 60 days of no engagement",
        "Resurface nudge shows the item title + a key annotation or connection as context",
        "Optional reflection prompt: 'What was the key insight from [item]?' — user can type a quick response that becomes an annotation",
        "Resurfacing can be paused per-item ('I'm done with this') or globally",
        "Dashboard in Settings shows resurfacing queue stats: items in queue, upcoming, overdue"
      ]
    },
    {
      "id": "S24",
      "title": "[v2] Export and Sharing",
      "priority": 24,
      "passes": false,
      "description": "Export boards and items in various formats for sharing and interop.",
      "acceptanceCriteria": [
        "Export a board as: markdown document (.md), PDF, OPML",
        "Markdown export includes all items with titles, source URLs, annotations, and connections",
        "PDF export has clean formatting with board title as header",
        "Export individual items with annotations as a single markdown file",
        "'Send to Obsidian' action: exports as .md files to a user-configured folder path",
        "Share a board as a read-only web page (generates static HTML, user handles hosting)",
        "Export actions accessible via File menu and context menu on boards",
        "Batch export: select multiple items, export as a single markdown or zip"
      ]
    },
    {
      "id": "S25",
      "title": "[v2] Local Video Support",
      "priority": 25,
      "passes": false,
      "description": "Import and annotate local video files with timestamp-linked notes.",
      "acceptanceCriteria": [
        "Import local video files (.mp4, .mov, .mkv) as Item type .video",
        "Video player embedded in item reader view using AVKit",
        "Timestamp-linked annotations: click 'Annotate' while watching, annotation records the current playback timestamp",
        "Annotations display with clickable timestamps — clicking jumps to that point in the video",
        "Video thumbnail auto-generated from first frame or midpoint",
        "File stays at its original location (referenced, not copied) — or optionally copied to app sandbox",
        "Support for drag-and-drop video files into a board or inbox"
      ]
    },
    {
      "id": "S26",
      "title": "[v2] CloudKit Sync",
      "priority": 26,
      "passes": false,
      "description": "Sync all data across devices via CloudKit.",
      "acceptanceCriteria": [
        "SwiftData models backed by CloudKit container",
        "All entities sync: Items, Boards, Tags, Connections, Annotations, Nudges",
        "Conflict resolution: last-write-wins for scalar fields, merge for many-to-many relationships (tags, boards)",
        "Sync status indicator in toolbar (synced / syncing / error)",
        "Works offline — changes queue and sync when connection returns",
        "Initial sync handles large libraries gracefully (progressive loading, no UI freeze)",
        "Settings toggle to enable/disable sync (local-only is always an option)",
        "Future-ready: architecture supports an iOS companion app reading the same CloudKit container"
      ]
    }
  ]
}
